app/views/frontend/show.html.erb

SELECT  "contents".* FROM "contents" WHERE "contents"."id" = $1 LIMIT 1  [["id", 1]]
---
%>
        <div style="width=100%, height= 50px "><%=Content.find(content.content_id).text %></div>