app/views/menus/_form.html.erb

SELECT "typs".* FROM "typs"
---
    <%= f.label :typ_id %><br>
    <%= f.select :typ_id, options_for_select(Typ.all.map{|s|[s.discription, s.id]}) %>

SELECT "locations".* FROM "locations"
---
    <%= f.label :location_id %><br>
    <%= f.select :location_id, options_for_select(Location.all.map{|s|[s.name, s.id]}) %>