app/views/menus/show.html.erb

SELECT  "typs".* FROM "typs" WHERE "typs"."id" = $1 LIMIT 1  [["id", nil]]
---
  <strong>Typ:</strong>
  <%= Typ.find(@menu.typ_id).discription %>

SELECT  "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT 1  [["id", 2]]
---
  <strong>Location:</strong>
  <%= Location.find(@menu.location_id).name %>