app/controllers/contents_controller.rb

SELECT "contents".* FROM "contents"
---
  def index
    @contents = Content.all

INSERT INTO "contents" ("text", "useronly", "active", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "test123"], ["useronly", "f"], ["active", "f"], ["created_at", "2015-02-27 15:09:53.281799"], ["updated_at", "2015-02-27 15:09:53.281799"]]
---
  def create
    @content = Content.new(content_params)

    respond_to do |format|
      if @content.save

UPDATE "contents" SET "active" = $1, "updated_at" = $2 WHERE "contents"."id" = $3  [["active", "t"], ["updated_at", "2015-02-27 15:11:17.609704"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @content.update(content_params)

SELECT  "contents".* FROM "contents" WHERE "contents"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_content
      @content = Content.find(params[:id])