app/controllers/examples_controller.rb

  def set_content
    @content = Content.find(1)
    @vmenu = Menu.where(typ: '2' , location: '1')
---
SELECT  "contents".* FROM "contents" WHERE "contents"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "menus".* FROM "menus" WHERE "menus"."typ" = ? AND "menus"."location" = ? LIMIT 1  [["typ", 2], ["location", 1]]