app/controllers/frontend_controller.rb

SELECT "contentperpages".* FROM "contentperpages" WHERE "contentperpages"."menu_id" = $1  [["menu_id", 2]]
---
  def set_content
    @content = Contentperpage.where(menu_id: params[:menu])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "menus".* FROM "menus" WHERE "menus"."typ_id" = 2 AND "menus"."location_id" = 2
SELECT  "images".* FROM "images"  ORDER BY "images"."id" ASC LIMIT 1
---
 def set_before_values
   if user_signed_in?
     if current_user.email == 'admin'
       user = User.find(1)
       user.add_role :admin
     end
    end
   @layoutme = 0
   @vmenu = Menu.where(typ: '2' , location: '2')
   @hmenu = Menu.where(typ: '1' , location: '2')
    @images=Image.all