app/controllers/images_controller.rb

INSERT INTO "images" ("name", "description", "file_file_name", "file_content_type", "file_file_size", "file_updated_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @image = Image.new(image_params)

    respond_to do |format|
      if @image.save