app/controllers/menus_controller.rb

SELECT "menus".* FROM "menus"
---
  def index
    @menus = Menu.all

SELECT COUNT(*) FROM "menus" WHERE "menus"."typ_id" = $1 AND "menus"."location_id" = $2  [["typ_id", 1], ["location_id", 2]]
INSERT INTO "menus" ("name", "location_id", "typ_id", "order", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "menu1"], ["location_id", 2], ["typ_id", 1], ["order", 1], ["created_at", "2015-02-27 15:50:05.026494"], ["updated_at", "2015-02-27 15:50:05.026494"]]
---
  def create
    @menu = Menu.new(menu_params)
    if Menu.where(typ_id: @menu.typ_id,location_id: @menu.location_id).any?
    @menu.order = Menu.where(typ_id: @menu.typ_id,location_id: @menu.location_id).order(order: :desc).first.order.to_i + 1
    else
      @menu.order = 1
      end
    respond_to do |format|
      if @menu.save

UPDATE "menus" SET "typ" = ?, "order" = ?, "location" = ?, "updated_at" = ? WHERE "menus"."id" = ?  [["typ", 1], ["order", 3], ["location", 1], ["updated_at", "2015-02-19 20:48:01.050000"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @menu.update(menu_params)

DELETE FROM "menus" WHERE "menus"."id" = ?  [["id", 3]]
---
  def destroy
    @menu.destroy

SELECT  "menus".* FROM "menus" WHERE "menus"."id" = ? LIMIT 1  [["id", 3]]
SELECT "locations".* FROM "locations"
SELECT "typs".* FROM "typs"
---
    def set_menu
      @menu = Menu.find(params[:id])
      @locations = Location.all
      @typsall = Typ.all