app/controllers/sites_controller.rb

  def index
    @sites = Site.all
---
SELECT "sites".* FROM "sites"

  def create
    @site = Site.new(site_params)

    respond_to do |format|
      if @site.save
---
INSERT INTO "sites" ("impressum", "created_at", "updated_at") VALUES (?, ?, ?)  [["impressum", "asdasd"], ["created_at", "2015-02-18 20:00:12.355135"], ["updated_at", "2015-02-18 20:00:12.355135"]]

    def set_site
      @site = Site.find(params[:id])
---
SELECT  "sites".* FROM "sites" WHERE "sites"."id" = ? LIMIT 1  [["id", 1]]