app/controllers/useradministration_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT  "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT 1  [["id", 1]]
---
  def remove
    @user= User.find(params[:user_id])
    @role=Role.find(params[:role_id]).name

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
SELECT "roles".* FROM "roles"
---
  def set_userdata
    @user = User.find(params[:id])
    @rollen= @user.roles
    @rolle= Role.all